app/views/friends/_form.html.erb

SELECT "cities".* FROM "cities"
---
                <%= form.label :city_id, "类别", class: "font-weight-bold" %>
                <%= form.select :city_id, options_for_select(City.all.map { |c| [c.name, c.id] }), {}, class: "form-control" %>

SELECT "tags".* FROM "tags"
---
            <div class="form-check form-check-inline">
              <%= collection_check_boxes(nil, :tag_id, Tag.all, :id, :label_male) do |b| %>