app/views/friends/index.html.erb

              </h4>
              <% friend.tags_sorted[0...3].each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "tag_relations" ON "tags"."id" = "tag_relations"."tag_id" WHERE "tag_relations"."friend_id" = ?  [["friend_id", 1]]