app/views/friends/show.html.erb

SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 22]]
---
        </button>
      <% elsif current_user.friends.empty? %>

SELECT "tags".* FROM "tags" INNER JOIN "tag_relations" ON "tags"."id" = "tag_relations"."tag_id" WHERE "tag_relations"."friend_id" = ?  [["friend_id", 1]]
---
  <h5 class="mt-4">Tags:</h5>
  <% @friend.tags_sorted.each do |tag| %>