app/views/shared/_navbar.html.erb

SELECT "tags".* FROM "tags"
---
            <div class="form-group">
              <%= collection_check_boxes(nil, :tags, Tag.all, :id, :label_male) do |b| %>

SELECT "cities".* FROM "cities"
---
            <div class="form-group">
              <%= collection_radio_buttons(nil, :city, City.all, :id, :name, {}, { required: true }) do |b| %>