app/views/pages/index.html.erb

              <h3 class="m-0 tag-text">#<%= tag.label_male.downcase %></h3>
              <p class="m-0 tag-text"><%= tag.count %> 那些书籍有这个标签 <%= tag.city_name %></p>
---
SELECT  "cities".* FROM "cities" ORDER BY "cities"."id" ASC LIMIT ?  [["LIMIT", 1]]

              <h4 class="m-0 tag-text"><%= friend.first_name %></h4>
              <% friend.tags_sorted[0...3].each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "tag_relations" ON "tags"."id" = "tag_relations"."tag_id" WHERE "tag_relations"."friend_id" = ?  [["friend_id", 1]]