app/views/pages/search.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "tag_relations" ON "tags"."id" = "tag_relations"."tag_id" WHERE "tag_relations"."friend_id" = ?  [["friend_id", 1]]
---
              <h4 class="m-0 tag-text"><%= friend.first_name %><small class="text-muted">, <%= age friend.birthday %></small></h4>
              <% friend.tags_sorted[0...3].each do |tag| %>