app/controllers/exchanges_controller.rb

SELECT  "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def new
    # Get friends from GET params
    @friend = Friend.find(params[:friend_id])

SELECT  "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "exchanges" ("is_active", "friend_initier_id", "friend_receiver_id", "created_at", "updated_at", "start_date") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    # Get friends from POST params
    @friend = Friend.find_by_id(params[:exchange][:friend_initier_id])
    @other = Friend.find_by_id(params[:exchange][:friend_receiver_id])
    check_exchange_author && return
    @exchange = Exchange.new(exchange_params_create)
    if @exchange.save