app/controllers/friends_controller.rb

  def show
    if @friend.available? && @friend.user != current_user && current_user
      @friends_to_exchange = current_user.friends.select { |f| f.available? }
---
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 22]]

  def create
    @friend = Friend.new(friend_params_create)

    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("first_name", "birthday", "is_male", "description", "city_id", "user_id", "created_at", "updated_at", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)